apache/nuttx/arch/arm/include/s32k3xx/s32k3x4_irq.h
/****************************************************************************
 * arch/arm/include/s32k3xx/s32k3x4_irq.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

/* This file should never be included directly but, rather, only indirectly
 * through nuttx/irq.h
 */

#ifndef __ARCH_ARM_INCLUDE_S32K3XX_S32K3X4_IRQ_H
#define __ARCH_ARM_INCLUDE_S32K3XX_S32K3X4_IRQ_H

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* IRQ numbers.
 * The IRQ number corresponds to the vector number and hence maps directly to
 * bits in the NVIC.  This does, however, waste several words of memory in
 * the IRQ to handle mapping tables.
 */

/* External interrupts (vectors >= 16).
 * These definitions are chip-specific.
 */

/* CPU to CPU and Directed Interrupts */

#define S32K3XX_IRQ_CPU_TO_CPU1    (S32K3XX_IRQ_EXTINT +   0) /*   0: CPU to CPU interrupt 0 (Core 0 --> Core 1) */
#define S32K3XX_IRQ_CPU_TO_CPU2    (S32K3XX_IRQ_EXTINT +   1) /*   1: CPU to CPU interrupt 1 (Core 0 --> Core 1) */
#define S32K3XX_IRQ_CPU_TO_CPU3    (S32K3XX_IRQ_EXTINT +   2) /*   2: CPU to CPU interrupt 2 (Core 0 <-- Core 1) */
#define S32K3XX_IRQ_CPU_TO_CPU4    (S32K3XX_IRQ_EXTINT +   3) /*   3: CPU to CPU interrupt 3 (Core 0 <-- Core 1) */

/* Shared Peripheral Interrupts - On-Platform Vectors */

#define S32K3XX_IRQ_DMA_CH0        (S32K3XX_IRQ_EXTINT +   4) /*   4: DMA transfer complete and error CH0 */
#define S32K3XX_IRQ_DMA_CH1        (S32K3XX_IRQ_EXTINT +   5) /*   5: DMA transfer complete and error CH1 */
#define S32K3XX_IRQ_DMA_CH2        (S32K3XX_IRQ_EXTINT +   6) /*   6: DMA transfer complete and error CH2 */
#define S32K3XX_IRQ_DMA_CH3        (S32K3XX_IRQ_EXTINT +   7) /*   7: DMA transfer complete and error CH3 */
#define S32K3XX_IRQ_DMA_CH4        (S32K3XX_IRQ_EXTINT +   8) /*   8: DMA transfer complete and error CH4 */
#define S32K3XX_IRQ_DMA_CH5        (S32K3XX_IRQ_EXTINT +   9) /*   9: DMA transfer complete and error CH5 */
#define S32K3XX_IRQ_DMA_CH6        (S32K3XX_IRQ_EXTINT +  10) /*  10: DMA transfer complete and error CH6 */
#define S32K3XX_IRQ_DMA_CH7        (S32K3XX_IRQ_EXTINT +  11) /*  11: DMA transfer complete and error CH7 */
#define S32K3XX_IRQ_DMA_CH8        (S32K3XX_IRQ_EXTINT +  12) /*  12: DMA transfer complete and error CH8 */
#define S32K3XX_IRQ_DMA_CH9        (S32K3XX_IRQ_EXTINT +  13) /*  13: DMA transfer complete and error CH9 */
#define S32K3XX_IRQ_DMA_CH10       (S32K3XX_IRQ_EXTINT +  14) /*  14: DMA transfer complete and error CH10 */
#define S32K3XX_IRQ_DMA_CH11       (S32K3XX_IRQ_EXTINT +  15) /*  15: DMA transfer complete and error CH11 */
#define S32K3XX_IRQ_DMA_CH12       (S32K3XX_IRQ_EXTINT +  16) /*  16: DMA transfer complete and error CH12 */
#define S32K3XX_IRQ_DMA_CH13       (S32K3XX_IRQ_EXTINT +  17) /*  17: DMA transfer complete and error CH13 */
#define S32K3XX_IRQ_DMA_CH14       (S32K3XX_IRQ_EXTINT +  18) /*  18: DMA transfer complete and error CH14 */
#define S32K3XX_IRQ_DMA_CH15       (S32K3XX_IRQ_EXTINT +  19) /*  19: DMA transfer complete and error CH15 */
#define S32K3XX_IRQ_DMA_CH16       (S32K3XX_IRQ_EXTINT +  20) /*  20: DMA transfer complete and error CH16 */
#define S32K3XX_IRQ_DMA_CH17       (S32K3XX_IRQ_EXTINT +  21) /*  21: DMA transfer complete and error CH17 */
#define S32K3XX_IRQ_DMA_CH18       (S32K3XX_IRQ_EXTINT +  22) /*  22: DMA transfer complete and error CH18 */
#define S32K3XX_IRQ_DMA_CH19       (S32K3XX_IRQ_EXTINT +  23) /*  23: DMA transfer complete and error CH19 */
#define S32K3XX_IRQ_DMA_CH20       (S32K3XX_IRQ_EXTINT +  24) /*  24: DMA transfer complete and error CH20 */
#define S32K3XX_IRQ_DMA_CH21       (S32K3XX_IRQ_EXTINT +  25) /*  25: DMA transfer complete and error CH21 */
#define S32K3XX_IRQ_DMA_CH22       (S32K3XX_IRQ_EXTINT +  26) /*  26: DMA transfer complete and error CH22 */
#define S32K3XX_IRQ_DMA_CH23       (S32K3XX_IRQ_EXTINT +  27) /*  27: DMA transfer complete and error CH23 */
#define S32K3XX_IRQ_DMA_CH24       (S32K3XX_IRQ_EXTINT +  28) /*  28: DMA transfer complete and error CH24 */
#define S32K3XX_IRQ_DMA_CH25       (S32K3XX_IRQ_EXTINT +  29) /*  29: DMA transfer complete and error CH25 */
#define S32K3XX_IRQ_DMA_CH26       (S32K3XX_IRQ_EXTINT +  30) /*  30: DMA transfer complete and error CH26 */
#define S32K3XX_IRQ_DMA_CH27       (S32K3XX_IRQ_EXTINT +  31) /*  31: DMA transfer complete and error CH27 */
#define S32K3XX_IRQ_DMA_CH28       (S32K3XX_IRQ_EXTINT +  32) /*  32: DMA transfer complete and error CH28 */
#define S32K3XX_IRQ_DMA_CH29       (S32K3XX_IRQ_EXTINT +  33) /*  33: DMA transfer complete and error CH29 */
#define S32K3XX_IRQ_DMA_CH30       (S32K3XX_IRQ_EXTINT +  34) /*  34: DMA transfer complete and error CH30 */
#define S32K3XX_IRQ_DMA_CH31       (S32K3XX_IRQ_EXTINT +  35) /*  35: DMA transfer complete and error CH31 */
#define S32K3XX_IRQ_ERM_SBE        (S32K3XX_IRQ_EXTINT +  36) /*  36: Error Reporting Module single bit ECC error interrupt */
#define S32K3XX_IRQ_ERM_MBE        (S32K3XX_IRQ_EXTINT +  37) /*  37: Error Reporting Module multi bit ECC error interrupt */
#define S32K3XX_IRQ_MCM_FPU        (S32K3XX_IRQ_EXTINT +  38) /*  38: Miscellaneous Control Module FPU interrupts */
#define S32K3XX_IRQ_STM0           (S32K3XX_IRQ_EXTINT +  39) /*  39: System Timer Module 0 interrupt */
#define S32K3XX_IRQ_STM1           (S32K3XX_IRQ_EXTINT +  40) /*  40: System Timer Module 1 interrupt */
#define S32K3XX_IRQ_RESERVED41     (S32K3XX_IRQ_EXTINT +  41) /*  41: Reserved */
#define S32K3XX_IRQ_SWT0           (S32K3XX_IRQ_EXTINT +  42) /*  42: System Watchdog Timer 0 initial time-out interrupt */
#define S32K3XX_IRQ_SWT1           (S32K3XX_IRQ_EXTINT +  43) /*  43: System Watchdog Timer 1 initial time-out interrupt */
#define S32K3XX_IRQ_RESERVED44     (S32K3XX_IRQ_EXTINT +  44) /*  44: Reserved */
#define S32K3XX_IRQ_CTI0           (S32K3XX_IRQ_EXTINT +  45) /*  45: Cross Trigger Interface interrupt 0 */
#define S32K3XX_IRQ_CTI1           (S32K3XX_IRQ_EXTINT +  46) /*  46: Cross Trigger Interface interrupt 1 */
#define S32K3XX_IRQ_RESERVED47     (S32K3XX_IRQ_EXTINT +  47) /*  47: Reserved */

